In [2]:
import pandas as pd
import numpy as np

In [3]:
df1=pd.read_excel('E:\Data_for_Analysis\Sales_Data2.xlsx')
df1

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
1     2          45  counselling      45  north
2     3          78    marketing      78   west
3     4          34           IT       3   west
4     5           8        sales      14  south
5     6          55           HR      66  north

# loc & iloc

In [6]:
#loc--->>  The loc property is used to access a group of rows and columns by label(s) or a boolean array. Its not work on index

df1.loc[4]   # its gives value series wise

S.no              5
Sales 2015        8
Dept.         sales
Profit           14
Region        south
Name: 4, dtype: object

In [7]:
df1.loc[[3]]  # its gives value row n colunm wise

   S.no  Sales 2015 Dept.  Profit Region
3     4          34    IT       3   west

In [10]:
df1.loc[[1,4]]

   S.no  Sales 2015        Dept.  Profit Region
1     2          45  counselling      45  north
4     5           8        sales      14  south

In [8]:
df1.loc[[4,5],'Profit']

4    14
5    66
Name: Profit, dtype: int64

In [7]:
#slicing

df1.loc[1:3]

   S.no  Sales 2015        Dept.  Profit Region
1     2          45  counselling      45  north
2     3          78    marketing      78   west
3     4          34           IT       3   west

In [16]:
df1.loc[[True,True,False,True,False,True]]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
1     2          45  counselling      45  north
3     4          34           IT       3   west
5     6          55           HR      66  north

In [17]:
df1

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
1     2          45  counselling      45  north
2     3          78    marketing      78   west
3     4          34           IT       3   west
4     5           8        sales      14  south
5     6          55           HR      66  north

In [19]:
df1.loc[1:5,['Sales 2015','Region']]

   Sales 2015 Region
1          45  north
2          78   west
3          34   west
4           8  south
5          55  north

In [21]:
df1.loc[0:3,['Dept.','Region','Profit']]

         Dept. Region  Profit
0  Electronics  east       56
1  counselling  north      45
2    marketing   west      78
3           IT   west       3

In [23]:
#Condition

df1.loc[df1['Profit']>=56]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
2     3          78    marketing      78   west
5     6          55           HR      66  north

In [24]:
df1.loc[df1['Profit']>=56,'Dept.']

0    Electronics
2      marketing
5             HR
Name: Dept., dtype: object

In [26]:
df1.loc[df1['Profit']>=56,['Dept.','Profit']]

         Dept.  Profit
0  Electronics      56
2    marketing      78
5           HR      66

In [4]:
df1

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
1     2          45  counselling      45  north
2     3          78    marketing      78   west
3     4          34           IT       3   west
4     5           8        sales      14  south
5     6          55           HR      66  north

# iloc

In [5]:
df1.iloc[2]

S.no                  3
Sales 2015           78
Dept.         marketing
Profit               78
Region             west
Name: 2, dtype: object

In [ ]:
df1.iat()

In [9]:
df1.iloc[0:4]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
1     2          45  counselling      45  north
2     3          78    marketing      78   west
3     4          34           IT       3   west

In [11]:
df1.iloc[[4,3,0]]

   S.no  Sales 2015        Dept.  Profit Region
4     5           8        sales      14  south
3     4          34           IT       3   west
0     1          23  Electronics      56  east

In [13]:
df1.iloc[[True, False, True,True, False, True]]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
2     3          78    marketing      78   west
3     4          34           IT       3   west
5     6          55           HR      66  north

In [14]:
df1.iloc[lambda x: x.index % 2 == 0]

   S.no  Sales 2015        Dept.  Profit Region
0     1          23  Electronics      56  east
2     3          78    marketing      78   west
4     5           8        sales      14  south

In [15]:
df1.iloc[[0, 2], [1, 3]]

   Sales 2015  Profit
0          23      56
2          78      78